package homework_09;

/**
 * @author Sergey Bugaenko
 * {@code @date} 23.09.2024
 */

/*
Task 0
Написать метод, принимающий на вход строку. Метод должен вывести на экран число, соответсвующее количеству символов в строке.

Например: Если в метод пришла строка "hello" - метод должен вывести число 5 (так как в строке hello 5 символов)
 */

public class Task0 {
    public static void main(String[] args) {

    } // Methods area

    public static void printStringLength(String string) {

        System.out.println("Длина строки: " + string.length());

    }



}
